In [3]:
import numpy as np
import pandas as pd

In [17]:
labels=['a','b','c']
my_data=[10,20,30]
arr=np.array(my_data)
d={'a':10,'b':20,'c':30}

In [12]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [18]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [19]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

In [20]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [21]:
pd.Series(data=[sum,print,len])#can hold different object types

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [25]:
ser1=pd.Series([1,2,3,4],['usa','germany','ussr','japan'])
ser1

usa        1
germany    2
ussr       3
japan      4
dtype: int64

In [27]:
ser3=pd.Series(data=labels)
ser3

0    a
1    b
2    c
dtype: object

In [28]:
ser3[0]

'a'

In [30]:
ser1+ser3

0          NaN
1          NaN
2          NaN
germany    NaN
japan      NaN
usa        NaN
ussr       NaN
dtype: object

In [32]:
from numpy.random import randn

In [94]:
np.random.seed(101)
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [38]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [69]:
df.iloc[[1,2],[0,3]]

          W         Z
B  0.651118  0.605965
C -2.018168 -0.589001

In [71]:
df.loc[['B','C'],['W','Z']]

          W         Z
B  0.651118  0.605965
C -2.018168 -0.589001

In [90]:
df['new']=df['W']+df['Y']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [91]:
df.drop('new',axis=1,inplace=True)# inplace for permanantly deleting
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [85]:
df.drop('E',axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [87]:
df.shape# shows 5 rows and 4 columns here .....this is why rows are 0 (5)axis and columns are 1 (4)axis

(5, 4)

In [88]:
df.loc['B','Y']

-0.8480769834036315

In [95]:
booldf=df>0
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [96]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [97]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [99]:
df[df['W']>0][['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [100]:
df[(df['W']>0)& (df['Y']>1) ]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [101]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [109]:
newind='ca ny wy or co'.split()
newind

['ca', 'ny', 'wy', 'or', 'co']

In [110]:
df['States']=newind
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     ca
B  0.651118 -0.319318 -0.848077  0.605965     ny
C -2.018168  0.740122  0.528813 -0.589001     wy
D  0.188695 -0.758872 -0.933237  0.955057     or
E  0.190794  1.978757  2.605967  0.683509     co

In [112]:
df.set_index('States')

               W         X         Y         Z
States
ca      2.706850  0.628133  0.907969  0.503826
ny      0.651118 -0.319318 -0.848077  0.605965
wy     -2.018168  0.740122  0.528813 -0.589001
or      0.188695 -0.758872 -0.933237  0.955057
co      0.190794  1.978757  2.605967  0.683509

In [116]:
outside=['G1','G1','G1','G2','G2','G2'] # turn two list into a tuple
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [118]:
df=pd.DataFrame(randn(6,2),hier_index,['A','B']) #two levle index G1 abd G2 ...a index hirarcy
df

             A         B
G1 1 -0.497104 -0.754070
   2 -0.943406  0.484752
   3 -0.116773  1.901755
G2 1  0.238127  1.996652
   2 -0.993263  0.196800
   3 -1.136645  0.000366

In [119]:
df.loc['G1'] #levle G1 is printed

          A         B
1 -0.497104 -0.754070
2 -0.943406  0.484752
3 -0.116773  1.901755

In [121]:
df.loc['G1'].loc[1]

A   -0.497104
B   -0.754070
Name: 1, dtype: float64

In [122]:
df.index.names=['Groups','Num'] # multi levle index
df

                   A         B
Groups Num
G1     1   -0.497104 -0.754070
       2   -0.943406  0.484752
       3   -0.116773  1.901755
G2     1    0.238127  1.996652
       2   -0.993263  0.196800
       3   -1.136645  0.000366

In [123]:
df.xs(1,level='Num')

               A         B
Groups
G1     -0.497104 -0.754070
G2      0.238127  1.996652

In [126]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [127]:
df=pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [128]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [129]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [130]:
df.fillna(value='Fill Value')

            A           B  C
0         1.0         5.0  1
1         2.0  Fill Value  2
2  Fill Value  Fill Value  3

In [134]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [175]:
data={'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
      'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
     'Sales':[200,120,340,124,243,350],
     'Index':[1,2,3,4,5,6]}
df=pd.DataFrame(data)
df

  Company   Person  Sales  Index
0    GOOG      Sam    200      1
1    GOOG  Charlie    120      2
2    MSFT      Amy    340      3
3    MSFT  Vanessa    124      4
4      FB     Carl    243      5
5      FB    Sarah    350      6

In [147]:
byCompa=df.groupby('Company')

In [141]:
byCompa.mean()

         Sales
Company
GOOG     220.0
MSFT     239.0

In [142]:
byCompa.sum()

         Sales
Company
GOOG       660
MSFT       717

In [143]:
byCompa.std()

              Sales
Company
GOOG     111.355287
MSFT     113.053085

In [148]:
byCompa.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [149]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [150]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [153]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [155]:
df=pd.DataFrame({'col1':[1,2,3,4],
                'col2':[444,555,666,444],
                'col3':['abc','def','ghi','jkl']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  jkl

In [157]:
df['col2'].unique()

array([444, 555, 666])

In [160]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [163]:
df[(df['col1']>2) & (df['col2']==444)]# conditional selection

   col1  col2 col3
3     4   444  jkl

In [166]:
def times2(x):
    return x*2

In [167]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [168]:
df['col3'].apply(lambda x:x*2)

0    abcabc
1    defdef
2    ghighi
3    jkljkl
Name: col3, dtype: object

In [169]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  jkl
1     2   555  def
2     3   666  ghi

In [170]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [177]:
df.pivot_table(values='Index',index=['Company','Person'],columns=['Sales']) # changing the table row and column

Sales            120  124  200  243  340  350
Company Person
FB      Carl     NaN  NaN  NaN  5.0  NaN  NaN
        Sarah    NaN  NaN  NaN  NaN  NaN  6.0
GOOG    Charlie  2.0  NaN  NaN  NaN  NaN  NaN
        Sam      NaN  NaN  1.0  NaN  NaN  NaN
MSFT    Amy      NaN  NaN  NaN  NaN  3.0  NaN
        Vanessa  NaN  4.0  NaN  NaN  NaN  NaN